dasdasd12/hardware/firmware/ch585/applications/half_scan/main.c
#include "CONFIG.h"
#include "HAL.h"

#include <string.h>

#include "aik_approval_control.h"
#include "aik_host_shortcut.h"
#include "aik_spi_protocol.h"
#include "ch585_ads7948_mux_acq.h"
#include "ch585_board_config.h"
#include "ch585_half_report.h"
#include "ch585_profile.h"

#ifndef CH585_BLE_PAIRING_EXT_EEPROM
#define CH585_BLE_PAIRING_EXT_EEPROM 0
#endif
#if CH585_BLE_PAIRING_EXT_EEPROM
#include "ch585_eeprom_i2c.h"
#endif
#if CH585_BLE_HID_ENABLE
#include "ble_hid.h"
#endif
#include "ch585_rf_nkro_tx.h"
#include "ch585_spi0_slave_link.h"
#include "magnetic_key_engine.h"

__attribute__((aligned(4))) uint32_t MEM_BUF[BLE_MEMHEAP_SIZE / 4];

#ifndef CH585_HALF_ID
#define CH585_HALF_ID AIK_HALF_ID_LEFT
#endif

#ifndef CH585_RF_TX_ENABLE
#define CH585_RF_TX_ENABLE 0
#endif

#ifndef CH585_BLE_HID_ENABLE
#define CH585_BLE_HID_ENABLE 0
#endif

#ifndef CH585_WIRELESS_MODE_SWITCH_ENABLE
#define CH585_WIRELESS_MODE_SWITCH_ENABLE \
    ((CH585_BOARD_HAS_WIRELESS_MODE_SWITCH != 0U) && \
     (CH585_HALF_ID == AIK_HALF_ID_LEFT) && \
     CH585_RF_TX_ENABLE && CH585_BLE_HID_ENABLE)
#endif

#ifndef CH585_SPI_ACCEPT_HOST_CMD
#define CH585_SPI_ACCEPT_HOST_CMD (CH585_RF_TX_ENABLE || CH585_BLE_HID_ENABLE)
#endif

#ifndef CH585_HALF_SCAN_DEBUG_UART
#define CH585_HALF_SCAN_DEBUG_UART 0
#endif

#ifndef CH585_HALF_SCAN_DEBUG_UART_BAUD
#define CH585_HALF_SCAN_DEBUG_UART_BAUD 921600U
#endif

#ifndef CH585_HALF_SCAN_DEBUG_PERIOD_FRAMES
#define CH585_HALF_SCAN_DEBUG_PERIOD_FRAMES 100U
#endif

#ifndef CH585_LOCAL_ROTARY_PULSE_FRAMES
#define CH585_LOCAL_ROTARY_PULSE_FRAMES 6U
#endif

#ifndef CH585_LOCAL_WHEEL_PULSE_FRAMES
#define CH585_LOCAL_WHEEL_PULSE_FRAMES 32U
#endif

#ifndef CH585_LOCAL_ROTARY_QUAD_STEPS_PER_EVENT
#define CH585_LOCAL_ROTARY_QUAD_STEPS_PER_EVENT 2
#endif

#ifndef CH585_LOCAL_ROTARY_QUAD_STEPS_PER_EVENT_RIGHT
#define CH585_LOCAL_ROTARY_QUAD_STEPS_PER_EVENT_RIGHT 2
#endif

#ifndef CH585_LOCAL_SWITCH_DEBOUNCE_FRAMES
#define CH585_LOCAL_SWITCH_DEBOUNCE_FRAMES 3U
#endif

#ifndef CH585_LOCAL_SWITCH_ENTER_GUARD_FRAMES
#define CH585_LOCAL_SWITCH_ENTER_GUARD_FRAMES 50U
#endif

#ifndef CH585_LOCAL_SWITCH_ENTER_PULSE_FRAMES
#define CH585_LOCAL_SWITCH_ENTER_PULSE_FRAMES 6U
#endif

#ifndef CH585_LOCAL_BUTTON_DEBOUNCE_FRAMES
#define CH585_LOCAL_BUTTON_DEBOUNCE_FRAMES 12U
#endif

#ifndef CH585_LOCAL_BUTTON_PULSE_FRAMES
#define CH585_LOCAL_BUTTON_PULSE_FRAMES 6U
#endif

#ifndef CH585_LOCAL_BUTTON_COOLDOWN_FRAMES
#define CH585_LOCAL_BUTTON_COOLDOWN_FRAMES 100U
#endif

#ifndef CH585_WIRELESS_MODE_SWITCH_DEBOUNCE_FRAMES
/* The normal H417 poll cadence is 125 us, so 160 frames is about 20 ms. */
#define CH585_WIRELESS_MODE_SWITCH_DEBOUNCE_FRAMES 160U
#endif

#ifndef BLE_HID_KBD_REPORT_LEN
#define BLE_HID_KBD_REPORT_LEN 8U
#endif

#define CH585_LOCAL_SWITCH_CENTER_MASK 0x01U
#define CH585_LOCAL_SWITCH_UP_MASK     0x02U
#define CH585_LOCAL_SWITCH_DOWN_MASK   0x04U
#define CH585_LOCAL_SWITCH_RIGHT_MASK  0x08U
#define CH585_LOCAL_SWITCH_LEFT_MASK   0x10U
#define CH585_LOCAL_SWITCH_DIR_MASK    0x1EU

#define CH585_LOCAL_SWITCH_GESTURE_NONE    0U
#define CH585_LOCAL_SWITCH_GESTURE_PENDING 1U
#define CH585_LOCAL_SWITCH_GESTURE_ENTER   2U
#define CH585_LOCAL_SWITCH_GESTURE_DIR     3U

#define CH585_WIRELESS_MODE_BLE_PB11       GPIO_Pin_11
#define CH585_WIRELESS_MODE_RF24_PB10      GPIO_Pin_10
#define CH585_WIRELESS_MODE_BLE_ACTIVE     0x01U
#define CH585_WIRELESS_MODE_RF24_ACTIVE    0x02U
#define CH585_WIRELESS_MODE_INVALID        0xFFU

#if CH585_HALF_SCAN_DEBUG_UART && !defined(DEBUG)
#error CH585_HALF_SCAN_DEBUG_UART requires DEBUG=Debug_UART1 or another WCH DEBUG UART.
#endif

static ch585_ads7948_mux_acq_t s_acq;
static mag_key_engine_t s_engine;
static aik_spi_half_state_v1_t s_tx_frame __attribute__((aligned(4)));
static aik_spi_host_cmd_v1_t s_rx_cmd __attribute__((aligned(4)));
static aik_spi_profile_status_v1_t s_profile_status __attribute__((aligned(4)));
static aik_spi_profile_xfer_v1_t s_profile_xfer __attribute__((aligned(4)));
static aik_spi_half_state_v1_t s_right_frame __attribute__((aligned(4)));
static uint8_t s_rf_nkro16[AIK_NKRO_REPORT_BYTES];
#if CH585_BLE_HID_ENABLE
static uint8_t s_ble_boot8[BLE_HID_KBD_REPORT_LEN];
#endif
static uint16_t s_compact_raw[AIK_KEY_COUNT_RIGHT];
static int s_last_spi_result;
static uint8_t s_profile_status_pending;
static uint8_t s_profile_xfer_pending;
static uint8_t s_right_frame_valid;
static uint8_t s_local_rotary_last_ab;
static int8_t s_local_rotary_accum;
static uint8_t s_local_rotary_cw_frames;
static uint8_t s_local_rotary_ccw_frames;
static uint32_t s_local_rotary_cw_total;
static uint32_t s_local_rotary_ccw_total;
static uint8_t s_local_rotary_debug_last_raw_ab;
static uint32_t s_local_rotary_debug_edge_count;
static volatile uint32_t s_local_rotary_debug_irq_count;
static volatile uint16_t s_local_rotary_debug_irq_flags;
static int16_t s_local_mouse_wheel_pending;
static uint8_t s_local_button_last_raw;
static uint8_t s_local_button_stable;
static uint8_t s_local_button_last_stable;
static uint8_t s_local_button_raw_count;
static uint8_t s_local_button_mute_frames;
static uint8_t s_local_button_mute_cooldown;
static uint8_t s_local_button_press_latched;
static uint8_t s_local_switch_last_raw;
static uint8_t s_local_switch_stable;
static uint8_t s_local_switch_raw_count;
static uint8_t s_local_switch_gesture;
static uint8_t s_local_switch_guard_frames;
static uint8_t s_local_switch_enter_frames;
#if CH585_BLE_HID_ENABLE
static uint32_t s_ble_sent_count;
static uint32_t s_ble_drop_count;
static uint16_t s_ble_last_consumer_usage;
#endif
#if CH585_RF_TX_ENABLE || CH585_BLE_HID_ENABLE
static uint8_t s_output_mode;
static int8_t s_last_output_mouse_wheel;
#endif
#if CH585_WIRELESS_MODE_SWITCH_ENABLE
static uint8_t s_wireless_mode_switch_last_raw;
static uint8_t s_wireless_mode_switch_raw_count;
static uint8_t s_wireless_mode_switch_mode;
#endif

static ch585_ads7948_mux_side_t half_scan_side(void)
{
    return (CH585_HALF_ID == AIK_HALF_ID_RIGHT) ?
        CH585_ADS7948_MUX_SIDE_RIGHT :
        CH585_ADS7948_MUX_SIDE_LEFT;
}

