dasdasd12/hardware/firmware/ch585/applications/half_scan/main.c
static void half_scan_build_down_bits(void)
{
    uint8_t key;
    uint8_t key_count = aik_spi_half_key_count((uint8_t)CH585_HALF_ID);

    memset(s_tx_frame.down_bits, 0, sizeof(s_tx_frame.down_bits));
    for(key = 0U; key < key_count; key++)
    {
        const mag_key_state_t *state = mag_key_engine_state(&s_engine, key);

        if((state != 0) && (state->is_down != 0U))
        {
            s_tx_frame.down_bits[key >> 3] |= (uint8_t)(1U << (key & 7U));
        }
    }
}

static uint8_t half_scan_gpioa_pressed(uint32_t pin)
{
    return (GPIOA_ReadPortPin(pin) == 0U) ? 1U : 0U;
}

static uint8_t half_scan_gpiob_pressed(uint32_t pin)
{
    return (GPIOB_ReadPortPin(pin) == 0U) ? 1U : 0U;
}

#if CH585_WIRELESS_MODE_SWITCH_ENABLE
static uint8_t half_scan_wireless_mode_switch_read_raw(void)
{
    uint8_t raw = 0U;

    if(half_scan_gpiob_pressed(CH585_WIRELESS_MODE_BLE_PB11) != 0U)
    {
        raw |= CH585_WIRELESS_MODE_BLE_ACTIVE;
    }
    if(half_scan_gpiob_pressed(CH585_WIRELESS_MODE_RF24_PB10) != 0U)
    {
        raw |= CH585_WIRELESS_MODE_RF24_ACTIVE;
    }
    return raw;
}

static uint8_t half_scan_wireless_mode_switch_decode(uint8_t raw)
{
    if(raw == CH585_WIRELESS_MODE_BLE_ACTIVE)
    {
        return AIK_OUTPUT_MODE_BLE;
    }
    if(raw == CH585_WIRELESS_MODE_RF24_ACTIVE)
    {
        return AIK_OUTPUT_MODE_RF24;
    }
    if(raw == 0U)
    {
        /* Center detent: neither externally pulled-up input is grounded. */
        return AIK_OUTPUT_MODE_USBHS;
    }
    /* Both low is not a valid position for this single-pole switch. */
    return CH585_WIRELESS_MODE_INVALID;
}

static void half_scan_wireless_mode_switch_state_init(void)
{
    uint8_t raw = half_scan_wireless_mode_switch_read_raw();
    uint8_t mode = half_scan_wireless_mode_switch_decode(raw);

    s_wireless_mode_switch_last_raw = raw;
    s_wireless_mode_switch_raw_count = 0U;
    /* Fail safely to wired mode if both contacts are unexpectedly low at
     * boot; later invalid samples retain the last valid position. */
    s_wireless_mode_switch_mode =
        (mode == CH585_WIRELESS_MODE_INVALID) ?
        AIK_OUTPUT_MODE_USBHS : mode;
}

static void half_scan_wireless_mode_switch_poll(void)
{
    uint8_t raw = half_scan_wireless_mode_switch_read_raw();
    uint8_t mode;

    if(raw != s_wireless_mode_switch_last_raw)
    {
        s_wireless_mode_switch_last_raw = raw;
        s_wireless_mode_switch_raw_count = 1U;
        return;
    }

    if(s_wireless_mode_switch_raw_count <
       CH585_WIRELESS_MODE_SWITCH_DEBOUNCE_FRAMES)
    {
        s_wireless_mode_switch_raw_count++;
    }
    if(s_wireless_mode_switch_raw_count <
       CH585_WIRELESS_MODE_SWITCH_DEBOUNCE_FRAMES)
    {
        return;
    }

    mode = half_scan_wireless_mode_switch_decode(raw);
    if(mode != CH585_WIRELESS_MODE_INVALID)
    {
        s_wireless_mode_switch_mode = mode;
    }
}
#endif

static uint8_t half_scan_read_rotary_ab(void)
{
    uint8_t a = half_scan_gpioa_pressed(GPIO_Pin_10);
    uint8_t b = half_scan_gpioa_pressed(GPIO_Pin_11);

    return (uint8_t)(a | (uint8_t)(b << 1));
}

static uint8_t half_scan_read_rotary_raw_ab(void)
{
    uint8_t a = (GPIOA_ReadPortPin(GPIO_Pin_10) != 0U) ? 1U : 0U;
    uint8_t b = (GPIOA_ReadPortPin(GPIO_Pin_11) != 0U) ? 1U : 0U;

    return (uint8_t)(a | (uint8_t)(b << 1));
}

static void half_scan_local_gpio_init(void)
{
    GPIOADigitalCfg(ENABLE, GPIO_Pin_7 | GPIO_Pin_10 | GPIO_Pin_11);
    GPIOBDigitalCfg(ENABLE, GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7);
    GPIOA_ModeCfg(GPIO_Pin_10 | GPIO_Pin_11, GPIO_ModeIN_PU);
    s_local_rotary_debug_last_raw_ab = half_scan_read_rotary_raw_ab();
    s_local_rotary_debug_edge_count = 0U;
    s_local_rotary_debug_irq_count = 0U;
    s_local_rotary_debug_irq_flags = 0U;
#if CH585_HALF_SCAN_DEBUG_UART
    GPIOA_ClearITFlagBit(GPIO_Pin_10 | GPIO_Pin_11);
    GPIOA_ITModeCfg(GPIO_Pin_10 | GPIO_Pin_11, GPIO_ITMode_FallEdge);
    PFIC_EnableIRQ(GPIO_A_IRQn);
#endif
    if(CH585_HALF_ID == AIK_HALF_ID_LEFT)
    {
        GPIOA_ModeCfg(GPIO_Pin_7, GPIO_ModeIN_PU);
        GPIOB_ModeCfg(GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7,
                      GPIO_ModeIN_PU);
    }
    else
    {
        GPIOA_ModeCfg(GPIO_Pin_7, GPIO_ModeIN_PU);
    }

#if CH585_WIRELESS_MODE_SWITCH_ENABLE
    /* PB10/PB11 are USBFS D-/D+ when RB_PIN_USB_EN is set. Keep that analog
     * function disabled and use floating digital inputs: R31/R50 provide the
     * external pull-ups and SW1 grounds the selected contact. PB11 is also an
     * optional boot pin, so production option bytes must retain default PB22. */
    GPIOAGPPCfg(DISABLE, RB_PIN_USB_EN);
    GPIOBDigitalCfg(ENABLE,
                    CH585_WIRELESS_MODE_BLE_PB11 |
                        CH585_WIRELESS_MODE_RF24_PB10);
    GPIOB_ModeCfg(CH585_WIRELESS_MODE_BLE_PB11 |
                      CH585_WIRELESS_MODE_RF24_PB10,
                  GPIO_ModeIN_Floating);
    half_scan_wireless_mode_switch_state_init();
#endif

    s_local_rotary_last_ab = half_scan_read_rotary_ab();
    s_local_rotary_accum = 0;
    s_local_rotary_cw_frames = 0U;
    s_local_rotary_ccw_frames = 0U;
    s_local_rotary_cw_total = 0U;
    s_local_rotary_ccw_total = 0U;
    s_local_mouse_wheel_pending = 0;
    s_local_button_last_raw = 0U;
    s_local_button_stable = 0U;
    s_local_button_last_stable = 0U;
    s_local_button_raw_count = 0U;
    s_local_button_mute_frames = 0U;
    s_local_button_mute_cooldown = 0U;
    s_local_button_press_latched = 0U;
    s_local_switch_last_raw = 0U;
    s_local_switch_stable = 0U;
    s_local_switch_raw_count = 0U;
    s_local_switch_gesture = CH585_LOCAL_SWITCH_GESTURE_NONE;
    s_local_switch_guard_frames = 0U;
    s_local_switch_enter_frames = 0U;
}

static void half_scan_queue_local_mouse_wheel(int8_t delta)
{
    if(CH585_HALF_ID != AIK_HALF_ID_LEFT)
    {
        return;
    }

    if((delta > 0) && (s_local_mouse_wheel_pending < 32))
    {
        s_local_mouse_wheel_pending++;
    }
    else if((delta < 0) && (s_local_mouse_wheel_pending > -32))
    {
        s_local_mouse_wheel_pending--;
    }
}

