dasdasd12/hardware/firmware/ch585/applications/half_scan/main.c
#if CH585_RF_TX_ENABLE || CH585_BLE_HID_ENABLE
static int8_t half_scan_take_local_mouse_wheel(void)
{
    if(CH585_HALF_ID != AIK_HALF_ID_LEFT)
    {
        return 0;
    }

    if(s_local_mouse_wheel_pending > 0)
    {
        s_local_mouse_wheel_pending--;
        return ch585_half_report_mouse_wheel_step(
            AIK_HP_SIGNAL_WHEEL_UP);
    }
    if(s_local_mouse_wheel_pending < 0)
    {
        s_local_mouse_wheel_pending++;
        return ch585_half_report_mouse_wheel_step(
            AIK_HP_SIGNAL_WHEEL_DOWN);
    }
    return 0;
}
#endif

static uint8_t half_scan_debounce_u8(uint8_t raw,
                                     uint8_t mask,
                                     uint8_t threshold,
                                     uint8_t *last_raw,
                                     uint8_t *raw_count,
                                     uint8_t *stable)
{
    raw &= mask;
    if(raw == *last_raw)
    {
        if(*raw_count < threshold)
        {
            (*raw_count)++;
        }
    }
    else
    {
        *last_raw = raw;
        *raw_count = 1U;
    }

    if(*raw_count >= threshold)
    {
        *stable = raw;
    }
    return *stable;
}

static void half_scan_local_rotary_poll(void)
{
    static const int8_t s_quad_delta[16] =
    {
         0, -1,  1,  0,
         1,  0,  0, -1,
        -1,  0,  0,  1,
         0,  1, -1,  0
    };
    uint8_t raw_ab = half_scan_read_rotary_raw_ab();
    uint8_t next_ab = half_scan_read_rotary_ab();
    uint8_t index = (uint8_t)((s_local_rotary_last_ab << 2) | next_ab);
    uint8_t pulse_frames =
        (CH585_HALF_ID == AIK_HALF_ID_LEFT) ?
        CH585_LOCAL_WHEEL_PULSE_FRAMES :
        CH585_LOCAL_ROTARY_PULSE_FRAMES;
    int8_t steps_per_event =
        (CH585_HALF_ID == AIK_HALF_ID_RIGHT) ?
        (int8_t)CH585_LOCAL_ROTARY_QUAD_STEPS_PER_EVENT_RIGHT :
        (int8_t)CH585_LOCAL_ROTARY_QUAD_STEPS_PER_EVENT;

    if(raw_ab != s_local_rotary_debug_last_raw_ab)
    {
        s_local_rotary_debug_last_raw_ab = raw_ab;
        s_local_rotary_debug_edge_count++;
    }

    s_local_rotary_last_ab = next_ab;
    s_local_rotary_accum =
        (int8_t)(s_local_rotary_accum + s_quad_delta[index & 0x0FU]);

    if(s_local_rotary_accum >= steps_per_event)
    {
        s_local_rotary_accum = 0;
        s_local_rotary_cw_frames = pulse_frames;
        s_local_rotary_ccw_frames = 0U;
        s_local_rotary_cw_total++;
        half_scan_queue_local_mouse_wheel(1);
    }
    else if(s_local_rotary_accum <= -steps_per_event)
    {
        s_local_rotary_accum = 0;
        s_local_rotary_ccw_frames = pulse_frames;
        s_local_rotary_cw_frames = 0U;
        s_local_rotary_ccw_total++;
        half_scan_queue_local_mouse_wheel(-1);
    }
}

static uint8_t half_scan_local_switch_stable_mask(void)
{
    uint8_t raw = 0U;

    if(half_scan_gpioa_pressed(GPIO_Pin_7) != 0U)
    {
        raw |= CH585_LOCAL_SWITCH_CENTER_MASK;
    }
    if(half_scan_gpiob_pressed(GPIO_Pin_7) != 0U)
    {
        raw |= CH585_LOCAL_SWITCH_UP_MASK;
    }
    if(half_scan_gpiob_pressed(GPIO_Pin_6) != 0U)
    {
        raw |= CH585_LOCAL_SWITCH_DOWN_MASK;
    }
    if(half_scan_gpiob_pressed(GPIO_Pin_5) != 0U)
    {
        raw |= CH585_LOCAL_SWITCH_RIGHT_MASK;
    }
    if(half_scan_gpiob_pressed(GPIO_Pin_4) != 0U)
    {
        raw |= CH585_LOCAL_SWITCH_LEFT_MASK;
    }

    return half_scan_debounce_u8(raw,
                                 CH585_LOCAL_SWITCH_CENTER_MASK |
                                     CH585_LOCAL_SWITCH_DIR_MASK,
                                 CH585_LOCAL_SWITCH_DEBOUNCE_FRAMES,
                                 &s_local_switch_last_raw,
                                 &s_local_switch_raw_count,
                                 &s_local_switch_stable);
}

static void half_scan_apply_left_five_way(void)
{
    uint8_t stable = half_scan_local_switch_stable_mask();
    uint8_t center = (uint8_t)(stable & CH585_LOCAL_SWITCH_CENTER_MASK);
    uint8_t dirs = (uint8_t)(stable & CH585_LOCAL_SWITCH_DIR_MASK);

    if(center == 0U)
    {
        if((s_local_switch_gesture ==
                CH585_LOCAL_SWITCH_GESTURE_PENDING) &&
           (dirs == 0U))
        {
            /* Preserve a fast center-only tap that released during the
             * direction-classification window. */
            s_local_switch_enter_frames =
                CH585_LOCAL_SWITCH_ENTER_PULSE_FRAMES;
        }
        else if(s_local_switch_gesture !=
                CH585_LOCAL_SWITCH_GESTURE_NONE)
        {
            s_local_switch_enter_frames = 0U;
        }
        s_local_switch_gesture = CH585_LOCAL_SWITCH_GESTURE_NONE;
        s_local_switch_guard_frames = 0U;
        if(s_local_switch_enter_frames != 0U)
        {
            aik_spi_half_set_bit(
                &s_tx_frame,
                AIK_LEFT_LOCAL_BIT_SCR_CENTER_QUALIFIED);
            aik_spi_half_set_bit(
                &s_tx_frame,
                AIK_LEFT_LOCAL_BIT_SCR_CENTER);
            s_local_switch_enter_frames--;
        }
        return;
    }

    if(s_local_switch_gesture == CH585_LOCAL_SWITCH_GESTURE_NONE)
    {
        s_local_switch_enter_frames = 0U;
        s_local_switch_gesture = CH585_LOCAL_SWITCH_GESTURE_PENDING;
        s_local_switch_guard_frames = CH585_LOCAL_SWITCH_ENTER_GUARD_FRAMES;
    }

    if(s_local_switch_gesture == CH585_LOCAL_SWITCH_GESTURE_PENDING)
    {
        if(dirs != 0U)
        {
            s_local_switch_gesture = CH585_LOCAL_SWITCH_GESTURE_DIR;
        }
        else if(s_local_switch_guard_frames != 0U)
        {
            s_local_switch_guard_frames--;
            return;
        }
        else
        {
            s_local_switch_gesture = CH585_LOCAL_SWITCH_GESTURE_ENTER;
            s_local_switch_enter_frames = CH585_LOCAL_SWITCH_ENTER_PULSE_FRAMES;
        }
    }

    if(s_local_switch_gesture == CH585_LOCAL_SWITCH_GESTURE_ENTER)
    {
        aik_spi_half_set_bit(
            &s_tx_frame,
            AIK_LEFT_LOCAL_BIT_SCR_CENTER_QUALIFIED);
        if(s_local_switch_enter_frames != 0U)
        {
            aik_spi_half_set_bit(&s_tx_frame, AIK_LEFT_LOCAL_BIT_SCR_CENTER);
            s_local_switch_enter_frames--;
        }
        return;
    }

    if(s_local_switch_gesture != CH585_LOCAL_SWITCH_GESTURE_DIR)
    {
        return;
    }

