dasdasd12/hardware/firmware/ch585/applications/half_scan/main.c
    if((dirs & CH585_LOCAL_SWITCH_UP_MASK) != 0U)
    {
        aik_spi_half_set_bit(&s_tx_frame, AIK_LEFT_LOCAL_BIT_SCR_UP);
    }
    if((dirs & CH585_LOCAL_SWITCH_DOWN_MASK) != 0U)
    {
        aik_spi_half_set_bit(&s_tx_frame, AIK_LEFT_LOCAL_BIT_SCR_DOWN);
    }
    if((dirs & CH585_LOCAL_SWITCH_RIGHT_MASK) != 0U)
    {
        aik_spi_half_set_bit(&s_tx_frame, AIK_LEFT_LOCAL_BIT_SCR_RIGHT);
    }
    if((dirs & CH585_LOCAL_SWITCH_LEFT_MASK) != 0U)
    {
        aik_spi_half_set_bit(&s_tx_frame, AIK_LEFT_LOCAL_BIT_SCR_LEFT);
    }
}

static void half_scan_local_button_poll(void)
{
    uint8_t stable = half_scan_debounce_u8(half_scan_gpioa_pressed(GPIO_Pin_7),
                                          1U,
                                          CH585_LOCAL_BUTTON_DEBOUNCE_FRAMES,
                                          &s_local_button_last_raw,
                                          &s_local_button_raw_count,
                                          &s_local_button_stable);

    if(s_local_button_mute_cooldown != 0U)
    {
        s_local_button_mute_cooldown--;
    }

    if(stable == 0U)
    {
        s_local_button_press_latched = 0U;
    }
    else if((s_local_button_press_latched == 0U) &&
            (s_local_button_last_stable == 0U) &&
            (s_local_button_mute_cooldown == 0U))
    {
        s_local_button_mute_frames = CH585_LOCAL_BUTTON_PULSE_FRAMES;
        s_local_button_mute_cooldown = CH585_LOCAL_BUTTON_COOLDOWN_FRAMES;
        s_local_button_press_latched = 1U;
    }
    s_local_button_last_stable = stable;
}

static void half_scan_encode_right_rotary_counts(void)
{
    aik_spi_half_set_2bit(
        &s_tx_frame,
        AIK_RIGHT_LOCAL_ROTARY_CW_COUNT_SHIFT,
        (uint8_t)(s_local_rotary_cw_total &
                  AIK_RIGHT_LOCAL_ROTARY_COUNT_MASK));
    aik_spi_half_set_2bit(
        &s_tx_frame,
        AIK_RIGHT_LOCAL_ROTARY_CCW_COUNT_SHIFT,
        (uint8_t)(s_local_rotary_ccw_total &
                  AIK_RIGHT_LOCAL_ROTARY_COUNT_MASK));
}

static void half_scan_apply_local_inputs(void)
{
    if(CH585_HALF_ID == AIK_HALF_ID_LEFT)
    {
        half_scan_local_rotary_poll();
        half_scan_apply_left_five_way();
        if(s_local_rotary_cw_frames != 0U)
        {
            aik_spi_half_set_bit(&s_tx_frame, AIK_LEFT_LOCAL_BIT_SCR_WHEEL_UP);
            s_local_rotary_cw_frames--;
        }
        if(s_local_rotary_ccw_frames != 0U)
        {
            aik_spi_half_set_bit(&s_tx_frame, AIK_LEFT_LOCAL_BIT_SCR_WHEEL_DOWN);
            s_local_rotary_ccw_frames--;
        }
#if CH585_WIRELESS_MODE_SWITCH_ENABLE
        half_scan_wireless_mode_switch_poll();
        aik_spi_left_set_output_mode(&s_tx_frame,
                                     s_wireless_mode_switch_mode);
#endif
    }
    else
    {
        half_scan_local_rotary_poll();
        half_scan_local_button_poll();
        half_scan_encode_right_rotary_counts();
        if(s_local_rotary_cw_frames != 0U)
        {
            aik_spi_half_set_bit(&s_tx_frame, AIK_RIGHT_LOCAL_BIT_EC11_CW);
            s_local_rotary_cw_frames--;
        }
        if(s_local_rotary_ccw_frames != 0U)
        {
            aik_spi_half_set_bit(&s_tx_frame, AIK_RIGHT_LOCAL_BIT_EC11_CCW);
            s_local_rotary_ccw_frames--;
        }
        if(s_local_button_mute_frames != 0U)
        {
            aik_spi_half_set_bit(&s_tx_frame, AIK_RIGHT_LOCAL_BIT_EC11_MUTE);
            s_local_button_mute_frames--;
        }
    }
}

static void half_scan_compact_raw(const ch585_ads7948_mux_acq_t *acq,
                                  uint16_t *compact,
                                  uint8_t key_count)
{
    const uint16_t *raw;
    const ch585_ads7948_mux_profile_t *profile;
    uint8_t key = 0U;
    uint8_t lane_index;

    if((acq == 0) || (compact == 0) || (acq->profile == 0))
    {
        return;
    }

    raw = ch585_ads7948_mux_acq_raw(acq);
    profile = acq->profile;
    for(lane_index = 0U;
        (lane_index < CH585_ADS7948_MUX_LANE_COUNT) && (key < key_count);
        lane_index++)
    {
        const ch585_ads7948_mux_lane_t *lane = &profile->lanes[lane_index];
        uint8_t mux;
        uint8_t mux_end = (uint8_t)(lane->mux_first + lane->mux_count);

        for(mux = lane->mux_first; (mux < mux_end) && (key < key_count); mux++)
        {
            uint16_t raw_index =
                ((uint16_t)lane_index * CH585_ADS7948_MUX_MUX_CHANNEL_COUNT) +
                (uint16_t)mux;

            compact[key++] = raw[raw_index];
        }
    }

    while(key < key_count)
    {
        compact[key++] = 0U;
    }
}

static void half_scan_build_frame(void)
{
    s_tx_frame.half_seq++;
    half_scan_build_down_bits();
    half_scan_apply_local_inputs();
    aik_spi_half_state_finish(&s_tx_frame,
                              aik_spi_half_frame_bits((uint8_t)CH585_HALF_ID));
}

static void half_scan_prepare_profile_status(uint16_t ack_seq)
{
    memset(&s_profile_status, 0, sizeof(s_profile_status));
    s_profile_status.ack_seq = ack_seq;
    s_profile_status.half_id = (uint8_t)CH585_HALF_ID;
    ch585_profile_fill_status(&s_profile_status);
    aik_spi_profile_status_finish(&s_profile_status);
    s_profile_status_pending = 1U;
}

static void half_scan_prepare_profile_xfer(void)
{
    ch585_profile_fill_xfer(&s_profile_xfer);
    s_profile_xfer_pending = 1U;
}

#if CH585_BLE_HID_ENABLE
static uint8_t half_scan_nkro_usage_down(
    const uint8_t nkro16[AIK_NKRO_REPORT_BYTES],
    uint8_t usage)
{
    uint8_t bit_index;
    uint8_t byte_index;

    if((usage < 0x04U) || (usage > 0x73U))
    {
        return 0U;
    }
    bit_index = (uint8_t)(usage - 0x04U);
    byte_index = (uint8_t)(2U + (bit_index >> 3));
    if(byte_index >= AIK_NKRO_REPORT_BYTES)
    {
        return 0U;
    }
    return (uint8_t)(
        (nkro16[byte_index] >> (bit_index & 7U)) & 1U);
}

static void half_scan_nkro16_to_boot8(const uint8_t nkro16[AIK_NKRO_REPORT_BYTES],
                                      uint8_t boot8[BLE_HID_KBD_REPORT_LEN])
{
    static const uint8_t priority_usages[3] = {
        AIK_APPROVAL_CONTROL_HID_USAGE_YES,
        AIK_APPROVAL_CONTROL_HID_USAGE_NO,
        AIK_HOST_SHORTCUT_HID_USAGE_F24
    };
    uint8_t byte_index;
    uint8_t out_index = 2U;
    uint8_t priority_index;

    memset(boot8, 0, BLE_HID_KBD_REPORT_LEN);
    boot8[0] = nkro16[0];
    for(priority_index = 0U;
        (priority_index < 3U) &&
        (out_index < BLE_HID_KBD_REPORT_LEN);
        priority_index++)
    {
        if(half_scan_nkro_usage_down(
               nkro16, priority_usages[priority_index]) != 0U)
        {
            boot8[out_index++] = priority_usages[priority_index];
        }
    }

