dasdasd12/hardware/firmware/ch585/applications/half_scan/main.c
    for(byte_index = 2U;
        (byte_index < AIK_NKRO_REPORT_BYTES) && (out_index < BLE_HID_KBD_REPORT_LEN);
        byte_index++)
    {
        uint8_t bits = nkro16[byte_index];
        uint8_t bit;

        for(bit = 0U; (bit < 8U) && (out_index < BLE_HID_KBD_REPORT_LEN); bit++)
        {
            if((bits & (uint8_t)(1U << bit)) != 0U)
            {
                uint8_t usage =
                    (uint8_t)(0x04U + ((byte_index - 2U) * 8U) + bit);

                if((usage != AIK_APPROVAL_CONTROL_HID_USAGE_YES) &&
                   (usage != AIK_APPROVAL_CONTROL_HID_USAGE_NO) &&
                   (usage != AIK_HOST_SHORTCUT_HID_USAGE_F24))
                {
                    boot8[out_index++] = usage;
                }
            }
        }
    }
}

static void half_scan_ble_send_consumer_events(uint16_t consumer_usage,
                                               int8_t consumer_delta)
{
    int8_t delta = consumer_delta;

    while(delta > 0)
    {
        if(BLE_HID_TriggerConsumerTap(AIK_CONSUMER_USAGE_VOLUME_UP) != SUCCESS)
        {
            s_ble_drop_count++;
            break;
        }
        delta--;
    }

    while(delta < 0)
    {
        if(BLE_HID_TriggerConsumerTap(AIK_CONSUMER_USAGE_VOLUME_DOWN) != SUCCESS)
        {
            s_ble_drop_count++;
            break;
        }
        delta++;
    }

    if((consumer_delta == 0) &&
       (consumer_usage != AIK_CONSUMER_USAGE_NONE) &&
       (s_ble_last_consumer_usage == AIK_CONSUMER_USAGE_NONE))
    {
        if(BLE_HID_TriggerConsumerTap(consumer_usage) != SUCCESS)
        {
            s_ble_drop_count++;
        }
    }

    s_ble_last_consumer_usage = consumer_usage;
}
#endif

#if CH585_RF_TX_ENABLE || CH585_BLE_HID_ENABLE
static uint8_t half_scan_sanitize_output_mode(uint8_t mode)
{
    if((mode == AIK_OUTPUT_MODE_RF24) || (mode == AIK_OUTPUT_MODE_BLE))
    {
        return mode;
    }
    return AIK_OUTPUT_MODE_USBHS;
}

static uint8_t half_scan_host_output_mode(uint8_t cmd, uint8_t flags)
{
    uint8_t mode = half_scan_sanitize_output_mode(
        (uint8_t)(flags & AIK_SPI_FLAG_OUTPUT_MODE_MASK));

#if CH585_RF_TX_ENABLE && !CH585_BLE_HID_ENABLE
    if((cmd == AIK_SPI_CMD_POLL_WITH_RF) ||
       (cmd == AIK_SPI_CMD_PUSH_RIGHT_STATE))
    {
        mode = AIK_OUTPUT_MODE_RF24;
    }
#else
    (void)cmd;
#endif

    return mode;
}

static void half_scan_radio_handoff_delay(void)
{
    uint8_t i;

    for(i = 0U; i < 4U; i++)
    {
        TMOS_SystemProcess();
        mDelaymS(1);
    }
}

static void half_scan_set_output_mode(uint8_t mode)
{
    mode = half_scan_sanitize_output_mode(mode);
    if(s_output_mode == mode)
    {
        return;
    }

#if CH585_BLE_HID_ENABLE
    /* Pause calibration before every handoff; wireless resumes below. */
    HAL_RadioCalibrationSetEnabled(0U);
#endif

    if(mode == AIK_OUTPUT_MODE_RF24)
    {
#if CH585_BLE_HID_ENABLE
        BLE_HID_DisableForRadio(150U);
        half_scan_radio_handoff_delay();
#endif
#if CH585_RF_TX_ENABLE
        ch585_rf_nkro_tx_set_enabled(1U);
#endif
    }
    else if(mode == AIK_OUTPUT_MODE_BLE)
    {
#if CH585_RF_TX_ENABLE
        ch585_rf_nkro_tx_set_enabled(0U);
#endif
#if CH585_BLE_HID_ENABLE
        BLE_HID_SetEnabled(1U);
#endif
    }
    else
    {
#if CH585_RF_TX_ENABLE
        /*
         * Do not spend the RF release burst between the SPI command and
         * its response. TMR0 sends those zero reports in the background
         * after this command has returned to the link loop.
         */
        ch585_rf_nkro_tx_disable_async();
#endif
#if CH585_BLE_HID_ENABLE
        BLE_HID_SetEnabled(0U);
#endif
    }

#if CH585_BLE_HID_ENABLE
    if(mode != AIK_OUTPUT_MODE_USBHS)
    {
        /* Resume later; never run calibration inside this SPI command. */
        HAL_RadioCalibrationSetEnabled(1U);
    }
#endif

#if CH585_BLE_HID_ENABLE
    if(mode != AIK_OUTPUT_MODE_BLE)
    {
        memset(s_ble_boot8, 0, sizeof(s_ble_boot8));
        s_ble_last_consumer_usage = AIK_CONSUMER_USAGE_NONE;
    }
#endif
    s_output_mode = mode;
}

static void half_scan_output_nkro16(const uint8_t nkro16[AIK_NKRO_REPORT_BYTES],
                                    uint16_t consumer_usage,
                                    int8_t consumer_delta,
                                    int8_t mouse_wheel,
                                    uint16_t host_seq,
                                    uint8_t output_mode)
{
    int8_t mouse_wheel_event = mouse_wheel;

    half_scan_set_output_mode(output_mode);

#if CH585_RF_TX_ENABLE
    if(s_output_mode == AIK_OUTPUT_MODE_RF24)
    {
        ch585_rf_nkro_tx_set_report(nkro16,
                                    consumer_usage,
                                    consumer_delta,
                                    mouse_wheel_event,
                                    host_seq,
                                    s_output_mode);
    }
#else
    (void)host_seq;
    (void)consumer_usage;
    (void)consumer_delta;
    (void)mouse_wheel_event;
#endif

#if CH585_BLE_HID_ENABLE
    if(s_output_mode == AIK_OUTPUT_MODE_BLE)
    {
        uint8_t next_boot8[BLE_HID_KBD_REPORT_LEN];

        half_scan_nkro16_to_boot8(nkro16, next_boot8);
        half_scan_ble_send_consumer_events(consumer_usage, consumer_delta);

        if(memcmp(s_ble_boot8, next_boot8, sizeof(s_ble_boot8)) != 0)
        {
            uint8_t status = BLE_HID_SendKeyboard(next_boot8);

            if(status == SUCCESS)
            {
                memcpy(s_ble_boot8, next_boot8, sizeof(s_ble_boot8));
                s_ble_sent_count++;
            }
            else
            {
                s_ble_drop_count++;
            }
        }
    }
#else
    (void)output_mode;
    (void)consumer_delta;
    (void)mouse_wheel;
#endif

    s_last_output_mouse_wheel = mouse_wheel;
}
#endif

static void half_scan_apply_host_cmd(void)
{
    if(aik_spi_host_cmd_valid(&s_rx_cmd) == 0U)
    {
        return;
    }

    if(s_rx_cmd.cmd == AIK_SPI_CMD_GET_PROFILE_STATUS)
    {
        half_scan_prepare_profile_status(s_rx_cmd.host_seq);
        return;
    }

    if((s_rx_cmd.cmd >= AIK_SPI_CMD_PROFILE_BEGIN) &&
       (s_rx_cmd.cmd <= AIK_SPI_CMD_PROFILE_GET_XFER))
    {
        uint8_t activates = (uint8_t)(
            s_rx_cmd.cmd == AIK_SPI_CMD_PROFILE_SET_ACTIVE);

