dasdasd12/hardware/firmware/ch585/applications/half_scan/main.c
        if(s_rx_cmd.cmd == AIK_SPI_CMD_PROFILE_COMMIT)
        {
            aik_spi_profile_commit_v1_t commit;

            aik_spi_host_cmd_get_payload(&s_rx_cmd, &commit,
                                         sizeof(commit));
            activates = (uint8_t)(
                (commit.patch_flags &
                 AIK_SPI_PROFILE_FLAG_ACTIVATE) != 0U);
        }
        ch585_profile_handle_transfer_cmd(&s_rx_cmd, &s_engine);
        half_scan_prepare_profile_xfer();
        if((activates != 0U) &&
           (s_profile_xfer.state == AIK_SPI_XFER_STATE_DONE))
        {
            s_local_mouse_wheel_pending = 0;
            ch585_half_report_arm_release_gate(
                &s_tx_frame,
                s_right_frame_valid ? &s_right_frame : 0);
        }
        return;
    }

#if CH585_SPI_ACCEPT_HOST_CMD
#if CH585_RF_TX_ENABLE || CH585_BLE_HID_ENABLE
    if(s_rx_cmd.cmd == AIK_SPI_CMD_POLL)
    {
        uint8_t output_mode = half_scan_host_output_mode(s_rx_cmd.cmd,
                                                         s_rx_cmd.flags);
        half_scan_set_output_mode(output_mode);
    }
    else if(s_rx_cmd.cmd == AIK_SPI_CMD_POLL_WITH_RF)
    {
        uint8_t output_mode = half_scan_host_output_mode(s_rx_cmd.cmd,
                                                         s_rx_cmd.flags);
        memcpy(s_rf_nkro16, s_rx_cmd.nkro16, sizeof(s_rf_nkro16));
        half_scan_output_nkro16(s_rf_nkro16,
                                aik_spi_host_cmd_consumer_usage(&s_rx_cmd),
                                aik_spi_host_cmd_consumer_delta(&s_rx_cmd),
                                half_scan_take_local_mouse_wheel(),
                                s_rx_cmd.host_seq,
                                output_mode);
    }
    else if(s_rx_cmd.cmd == AIK_SPI_CMD_PUSH_RIGHT_STATE)
    {
        aik_spi_half_state_v1_t next_right;
        uint8_t right_state_valid;
        uint8_t output_mode = half_scan_host_output_mode(s_rx_cmd.cmd,
                                                         s_rx_cmd.flags);

        memcpy(&next_right, s_rx_cmd.nkro16, sizeof(next_right));
        if(aik_spi_half_state_valid(&next_right) == 0U)
        {
            ch585_half_report_set_approval_context(
                (uint8_t)(
                    (s_rx_cmd.flags &
                     AIK_SPI_FLAG_APPROVAL_ACTIVE) != 0U),
                (uint8_t)(
                    (s_rx_cmd.flags &
                     AIK_SPI_FLAG_APPROVAL_SELECTED_YES) != 0U),
                0U);
            s_right_frame_valid = 0U;
            ch585_half_report_build_nkro16(
                &s_tx_frame, 0, s_rf_nkro16);
            half_scan_output_nkro16(
                s_rf_nkro16,
                AIK_CONSUMER_USAGE_NONE,
                0,
                0,
                s_rx_cmd.host_seq,
                output_mode);
            return;
        }

        right_state_valid = (uint8_t)(
            (s_rx_cmd.flags & AIK_SPI_FLAG_RIGHT_STATE_VALID) != 0U);
        ch585_half_report_set_approval_context(
            (uint8_t)(
                (s_rx_cmd.flags & AIK_SPI_FLAG_APPROVAL_ACTIVE) != 0U),
            (uint8_t)(
                (s_rx_cmd.flags &
                 AIK_SPI_FLAG_APPROVAL_SELECTED_YES) != 0U),
            right_state_valid);
        s_right_frame = next_right;
        s_right_frame_valid = right_state_valid;
        ch585_half_report_build_nkro16(&s_tx_frame,
                                       s_right_frame_valid ? &s_right_frame : 0,
                                       s_rf_nkro16);
        half_scan_output_nkro16(s_rf_nkro16,
                                aik_spi_host_cmd_consumer_usage(&s_rx_cmd),
                                aik_spi_host_cmd_consumer_delta(&s_rx_cmd),
                                half_scan_take_local_mouse_wheel(),
                                s_rx_cmd.host_seq,
                                output_mode);
    }
#endif
#else
    (void)s_rx_cmd;
#endif
}

#if CH585_HALF_SCAN_DEBUG_UART
static void half_scan_debug_uart_init(void)
{
    GPIOPinRemap(DISABLE, RB_PIN_UART1);
    GPIOA_SetBits(GPIO_Pin_9);
    GPIOA_ModeCfg(GPIO_Pin_8, GPIO_ModeIN_PU);
    GPIOA_ModeCfg(GPIO_Pin_9, GPIO_ModeOut_PP_5mA);
    UART1_DefInit();
    UART1_BaudRateCfg(CH585_HALF_SCAN_DEBUG_UART_BAUD);
}

static uint8_t half_scan_debug_first_down(uint8_t key_count)
{
    uint8_t key;

    for(key = 0U; key < key_count; key++)
    {
        if((s_tx_frame.down_bits[key >> 3] & (uint8_t)(1U << (key & 7U))) != 0U)
        {
            return key;
        }
    }
    return 0xFFU;
}

static void half_scan_debug_poll(uint8_t key_count)
{
    ch585_spi0_slave_link_stats_t spi_stats;
    uint16_t host_crc;
    uint16_t host_calc_crc;
    int8_t mouse_wheel_now;
#if CH585_RF_TX_ENABLE || CH585_BLE_HID_ENABLE
    int8_t last_output_mouse_wheel_debug = s_last_output_mouse_wheel;
#else
    int8_t last_output_mouse_wheel_debug = 0;
#endif
    uint8_t key;
    uint8_t rotary_ab;
    uint8_t rotary_raw_ab;
    uint8_t min_raw_key = 0U;
    uint8_t max_pos_key = 0U;
    uint16_t min_raw = 0xFFFFU;
    uint16_t max_pos = 0U;
#if CH585_SPI_ACCEPT_HOST_CMD
    uint8_t host_ok = aik_spi_host_cmd_valid(&s_rx_cmd);
#else
    uint8_t host_ok = 0U;
#endif

    if((s_tx_frame.half_seq % CH585_HALF_SCAN_DEBUG_PERIOD_FRAMES) != 0U)
    {
        return;
    }

    for(key = 0U; key < key_count; key++)
    {
        const mag_key_state_t *state = mag_key_engine_state(&s_engine, key);

        if(state == 0)
        {
            continue;
        }

        if(state->raw_adc < min_raw)
        {
            min_raw = state->raw_adc;
            min_raw_key = key;
        }
        if(state->position_pm > max_pos)
        {
            max_pos = state->position_pm;
            max_pos_key = key;
        }
    }

    ch585_spi0_slave_link_get_stats(&spi_stats);
    host_crc = s_rx_cmd.crc16;
    host_calc_crc = aik_spi_host_cmd_crc(&s_rx_cmd);
    rotary_ab = half_scan_read_rotary_ab();
    rotary_raw_ab = half_scan_read_rotary_raw_ab();
    mouse_wheel_now =
        ch585_half_report_mouse_wheel(&s_tx_frame,
                                      s_right_frame_valid ? &s_right_frame : 0);
    PRINT("hs half=%u seq=%u scan=%lu raw_min=%u:%u pos_max=%u:%u down=%02x%02x%02x%02x%02x%02x first=%u out=%u spi=%lu abort=%lu last=%d host=%u cmd=%u hseq=%u rxcnt=%u rx=%02x%02x%02x%02x hcrc=%04x/%04x rawab=%u redge=%lu irq=%lu if=%04x rot=%u racc=%d cw=%u ccw=%u cwT=%lu ccwT=%lu wh=%d pend=%d lastwh=%d\r\n",
          (unsigned int)CH585_HALF_ID,
          (unsigned int)s_tx_frame.half_seq,
          (unsigned long)s_acq.frames,
          (unsigned int)min_raw_key,
          (unsigned int)min_raw,
          (unsigned int)max_pos_key,
          (unsigned int)max_pos,
          (unsigned int)s_tx_frame.down_bits[0],
          (unsigned int)s_tx_frame.down_bits[1],
          (unsigned int)s_tx_frame.down_bits[2],
          (unsigned int)s_tx_frame.down_bits[3],
          (unsigned int)s_tx_frame.down_bits[4],
          (unsigned int)s_tx_frame.down_bits[5],
          (unsigned int)half_scan_debug_first_down(key_count),
#if CH585_RF_TX_ENABLE || CH585_BLE_HID_ENABLE
          (unsigned int)s_output_mode,
#else
          (unsigned int)AIK_OUTPUT_MODE_USBHS,
#endif
          (unsigned long)spi_stats.frames,
          (unsigned long)spi_stats.aborts,
          s_last_spi_result,
          (unsigned int)host_ok,
          (unsigned int)s_rx_cmd.cmd,
          (unsigned int)s_rx_cmd.host_seq,
          (unsigned int)spi_stats.last_rx_count,
          (unsigned int)spi_stats.last_rx_head[0],
          (unsigned int)spi_stats.last_rx_head[1],
          (unsigned int)spi_stats.last_rx_head[2],
          (unsigned int)spi_stats.last_rx_head[3],
          (unsigned int)host_crc,
          (unsigned int)host_calc_crc,
          (unsigned int)rotary_raw_ab,
          (unsigned long)s_local_rotary_debug_edge_count,
          (unsigned long)s_local_rotary_debug_irq_count,
          (unsigned int)s_local_rotary_debug_irq_flags,
          (unsigned int)rotary_ab,
          (int)s_local_rotary_accum,
          (unsigned int)s_local_rotary_cw_frames,
          (unsigned int)s_local_rotary_ccw_frames,
          (unsigned long)s_local_rotary_cw_total,
          (unsigned long)s_local_rotary_ccw_total,
          (int)mouse_wheel_now,
          (int)s_local_mouse_wheel_pending,
          (int)last_output_mouse_wheel_debug);
#if CH585_BLE_HID_ENABLE
    PRINT("ble conn=%u sent=%lu drop=%lu boot=%02x %02x %02x %02x %02x %02x %02x %02x\r\n",
          (unsigned int)BLE_HID_IsConnected(),
          (unsigned long)s_ble_sent_count,
          (unsigned long)s_ble_drop_count,
          (unsigned int)s_ble_boot8[0],
          (unsigned int)s_ble_boot8[1],
          (unsigned int)s_ble_boot8[2],
          (unsigned int)s_ble_boot8[3],
          (unsigned int)s_ble_boot8[4],
          (unsigned int)s_ble_boot8[5],
          (unsigned int)s_ble_boot8[6],
          (unsigned int)s_ble_boot8[7]);
#endif
}
#else
static void half_scan_debug_uart_init(void)
{
}

